Repository: 84000/data-translation-memory
Catalog: toh216-v3.tmx
Source language: bo
Languages: en

source: །དེས་ཆོས་བརྒྱད་ལ་བརྩོན་པར་བྱའོ།
en: They must exert themselves in eight practices.

source: །བརྒྱད་པོ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are the eight?

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གི་སྦྱོར་བ་ལ་བརྩོན་པར་བྱ་བ་དང་ཚངས་པའི་གནས་བཞི་བསྒྲུབ་པ་ལ་མངོན་པར་ཤེས་པ་ལྔ་ཤེས་ཤིང་རྟོགས་པར་ཁོང་དུ་ཆུད་པའི་ཡེ་ཤེས་དང་། བསྡུ་བའི་དངོས་པོ་བཞིས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་སྟེ། བཞི་པོ་གང་ཞེ་ན། སྦྱིན་པ་དང་། ཚིག་འཇམ་པོ་དང་། དོན་སྤྱད་པ་དང་། དོན་མཚུངས་པར་བྱ་བ་དག་དང་། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་ལ་བཟོད་པ་ཐོབ་པ་དང་། གཞན་སངས་རྒྱས་ཀྱི་ཆོས་ལ་གཞོག་པ་དང་། བདག་བྱང་ཆུབ་ཀྱི་སེམས་མི་གཏོང་བ་དང་།
en: They are (1) exertion in the practice of the six perfections; (2) the wisdom that accomplishes the four abodes of Brahmā and knows, realizes, and understands the five extraordinary abilities; (3) ripening beings with the four means of attracting disciples, which are generosity, kind talk, meaningful actions, and practicing what one preaches; (4) gaining acceptance of the three gateways of liberation; (5) establishing others in the qualities of buddhahood; (6) never giving up the mind of awakening; (7) making dedications with skillful means; and (8) being respectful and upholding the sublime Dharma.

source: ཐབས་མཁས་པས་སྔོ་བར་བྱེད་པ་དང་། གུས་པར་བྱས་ཤིང་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་སྟེ། ཆོས་བརྒྱད་པོ་དེ་དག་ལ་བརྩོན་པའི་བྱང་ཆུབ་སེམས་དཔས་ཐམས་ཅད་མཁྱེན་པ་རྟོགས་སོ།
en: Bodhisattvas who exert themselves in these eight practices will comprehend omniscience.”

source: །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་སྐྱེས་བུ་དམ་པ་དེ་དག་དང་། ལྷའི་བུ་དེ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཀྱེ་གྲོགས་པོ་དག་བྱང་ཆུབ་སེམས་དཔའ་གང་མ་འབྲེལ་པ་དང་།
en: Then Mañjuśrī Kumārabhūta addressed these sublime beings and gods, “Listen, friends!

source: མི་བརྩོན་པ་དེས་ཐམས་ཅད་མཁྱེན་པ་རྟོགས་སོ།
en: Bodhisattvas who do not associate or exert themselves will comprehend omniscience.

source: མ་འབྲེལ་ཅེས་བྱ་བ་ནི་ཁམས་གསུམ་དང་ངོ་།
en: That with which they are not associated is the three realms.

source: །མི་བརྩོན་ཞེས་བྱ་བ་ནི་རྟོག་པ་དང་། རྣམ་པར་རྟོག་པ་དང་། ཡོངས་སུ་རྟོག་པ་ཐམས་ཅད་ལའོ།
en: That in which they do not exert themselves is any thought, concept, or idea.

source: །མ་འབྲེལ་ཅེས་བྱ་བ་ནི་ནང་དང་ངོ་།
en: That with which they do not associate is the inner.

source: །མི་བརྩོན་ཞེས་བྱ་བ་ནི་ཕྱི་ལའོ།
en: That in which they do not exert themselves is the outer.

source: །མ་འབྲེལ་ཅེས་བྱ་བ་ནི་ཉན་ཐོས་ཀྱི་ས་དང་ངོ་།
en: That with which they do not associate is the level of hearers.

source: །མི་བརྩོན་ཞེས་བྱ་བ་ནི་རང་སངས་རྒྱས་ཀྱི་ས་ལའོ།
en: That in which they do not exert themselves is the level of solitary buddhas.

source: །མ་འབྲེལ་ཅེས་བྱ་བ་ནི་འཁོར་བ་ན་སྤྱོད་པའི་ཉོན་མོངས་པ་དང་ཉེ་བའི་ཉོན་མོངས་པ་རྣམས་དང་ངོ་།
en: Those with which they are not associated are the afflictions and subsidiary afflictions experienced in saṃsāra.

source: །མི་བརྩོན་ཞེས་བྱ་བ་ནི་བྱིས་པ་ལྟ་བུ་སོ་སོའི་སྐྱེ་བོའི་ཆོས་ཐམས་ཅད་ལའོ།
en: Those in which they do not exert themselves are all the phenomena of ordinary childish beings.

source: །མ་འབྲེལ་ཅེས་བྱ་བ་ནི་མིང་དང་ངོ་།
en: That with which they are not associated is name.

source: །མི་བརྩོན་ཞེས་བྱ་བ་ནི་གཟུགས་ལའོ།
en: That in which they do not exert themselves is form.

source: །མ་འབྲེལ་ཅེས་བྱ་བ་ནི་རྒྱུ་དང་ངོ་།
en: That with which they are not associated is cause.

source: །མི་བརྩོན་ཞེས་བྱ་བ་ནི་འབྲས་བུ་ལའོ།
en: That in which they do not exert themselves is effect.

source: །མ་འབྲེལ་ཅེས་བྱ་བ་ནི་ལྟ་བའི་རྣམ་པ་དང་ངོ་།
en: That with which they are not associated is views.

source: །མི་བརྩོན་ཞེས་བྱ་བ་ནི་ལྟ་བ་དང་བྲལ་བ་ལའོ།
en: That in which they do not exert themselves is the absence of views.

source: །མ་འབྲེལ་ཅེས་བྱ་བ་ནི་ཆགས་པ་དང་ངོ་།
en: That with which they are not associated is passion.

source: །མི་བརྩོན་ཞེས་བྱ་བ་ནི་ཁོང་ཁྲོ་བ་ལའོ།
en: That in which they do not exert themselves is anger.

source: །མ་འབྲེལ་ཅེས་བྱ་བ་ནི་ངར་འཛིན་པ་དང་ངོ་། །མི་བརྩོན་ཞེས་བྱ་བ་ནི་བདག་གིར་འཛིན་པ་ལའོ།
en: That with which they are not associated is clinging to I. That in which they do not exert themselves is clinging to mine.

source: །མ་འབྲེལ་ཅེས་བྱ་བ་ནི་སེར་སྣ་དང་ངོ་།
en: That with which they are not associated is stinginess.

source: །མི་བརྩོན་ཞེས་བྱ་བ་ནི་སྦྱིན་པའི་སྙེམས་པ་ལའོ།
en: That in which they do not exert themselves is arrogance about generosity.

source: །མ་འབྲེལ་ཅེས་བྱ་བ་ནི་ངང་ཚུལ་ངན་པ་དང་ངོ་།
en: That with which they are not associated is bad character.

source: །མི་བརྩོན་ཞེས་བྱ་བ་ནི་ཚུལ་ཁྲིམས་སྙེམས་པ་ལའོ།
en: That in which they do not exert themselves is arrogance about discipline.

source: །མ་འབྲེལ་ཅེས་བྱ་བ་ནི་གནོད་སེམས་དང་ངོ་།
en: That with which they are not associated is malice.

source: །མི་བརྩོན་ཞེས་བྱ་བ་ནི་བཟོད་པའི་སྙེམས་པ་ལའོ།
en: That in which they do not exert themselves is arrogance about patience.

source: །མ་འབྲེལ་ཅེས་བྱ་བ་ནི་ལེ་ལོ་དང་ངོ་།
en: That with which they are not associated is laziness.

source: །མི་བརྩོན་ཞེས་བྱ་བ་ནི་བརྩོན་འགྲུས་སྙེམས་པ་ལའོ།
en: That in which they do not exert themselves is arrogance about diligence.

source: །མ་འབྲེལ་ཅེས་བྱ་བ་ནི་དྲན་པ་ཉམས་པ་དང་ངོ་།
en: That with which they are not associated is spoiled mindfulness.

source: །མི་བརྩོན་ཞེས་བྱ་བ་ནི་བསམ་གཏན་སྙེམས་པ་ལའོ།
en: That in which they do not exert themselves is arrogance about concentration.

source: །མ་འབྲེལ་ཅེས་བྱ་བ་ནི་ཤེས་རབ་འཆལ་པ་དང་ངོ་།
en: That with which they are not associated is mistaken insight.

source: །མི་བརྩོན་ཞེས་བྱ་བ་ནི་ཤེས་རབ་སྙེམས་པ་ལའོ།
en: That in which they do not exert themselves is arrogance about insight.

source: །མ་འབྲེལ་ཅེས་བྱ་བ་ནི་དགེ་བ་དང་ངོ་།
en: That with which they are not associated is nonvirtue.

source: །མི་བརྩོན་ཞེས་བྱ་བ་ནི་དགེ་བའི་རྩ་བ་སྒྲོ་འདོགས་པ་ལའོ།
en: That in which they do not exert themselves is boasting about virtue.

source: །མ་འབྲེལ་ཅེས་བྱ་བ་ནི་འཇིག་རྟེན་གྱི་ཆོས་དང་ངོ་།
en: That with which they are not associated is worldly concerns.

source: །མི་བརྩོན་ཞེས་བྱ་བ་ནི་འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་མངོན་པར་བྱ་བར་ཆགས་པ་ལའོ།
en: That in which they do not exert themselves is attachment to manifesting transcendent qualities.

source: །མ་འབྲེལ་ཅེས་བྱ་བ་ནི་འདུས་བྱས་དང་ངོ་།
en: That with which they are not associated is conditioned phenomena.

source: །མི་བརྩོན་ཞེས་བྱ་བ་ནི་འདུས་མ་བྱས་པའི་ཆོས་ལ་ཡོངས་སུ་རྟོག་པ་ལའོ།
en: That in which they do not exert themselves is conceptualizing unconditioned phenomena.

source: །མ་འབྲེལ་ཅེས་བྱ་བ་ནི་ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་དང་ངོ་།
en: Those with which they are not associated are misdeeds.

source: །མི་བརྩོན་ཞེས་བྱ་བ་ནི་ཁ་ན་མ་ཐོ་བ་མེད་པའི་ཆོས་སྒྲོ་འདོགས་པ་ལའོ།
en: That in which they do not exert themselves is boasting about their proper deeds.

source: །མ་འབྲེལ་ཅེས་བྱ་བ་ནི་ཟག་པ་དང་བཅས་པ་དང་ངོ་།
en: That with which they are not associated is defilement.

source: །མི་བརྩོན་ཞེས་བྱ་བ་ནི་ཟག་པ་མེད་པའི་ཟད་པའི་ཆོས་སུ་སྙེམས་པ་ལའོ།
en: That in which they do not exert themselves is arrogance about their undefiled phenomena of exhaustion. “

source: །ཀྱེ་གྲོགས་པོ་དག་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་འབྲེལ་པ་དང་། མ་འབྲེལ་པར་ལྟ་བ་དང་བྲལ་བས་ཐམས་ཅད་མཁྱེན་པ་རྟོགས་མོད་ཀྱི།
en: Listen, friends! In this way, bodhisattva great beings who are free from the views of association and disassociation do indeed comprehend omniscience.

source: ཡང་ཀྱེ་གྲོགས་པོ་དག་ཐམས་ཅད་མཁྱེན་པ་ནི་མི་རྟོགས་སོ།
en: Yet listen, friends! Omniscience cannot be comprehended.

source: བྱེད་པས་ཐམས་ཅད་མཁྱེན་པ་རྟོགས་པར་མི་འགྱུར་རོ།
en: Omniscience cannot be comprehended through an action.

source: བྱེད་པ་དང་བྲལ་བ་ནི་ཐམས་ཅད་མཁྱེན་པ་ཡིན་ཏེ། ཐམས་ཅད་མཁྱེན་པ་ལ་རྟོགས་པར་བྱེད་པ་སུ་ཡང་མེད་དོ།
en: The absence of action is omniscience, and within omniscience there is no conceptual activity.

source: །ཐམས་ཅད་མཁྱེན་པ་ནི་གཟུགས་ཀྱིས་ཀྱང་མི་རྟོགས་ཚོར་བས་མ་ཡིན་འདུ་ཤེས་ཀྱིས་ཀྱང་མ་ཡིན། འདུ་བྱེད་ཀྱིས་ཀྱང་མ་ཡིན། རྣམ་པར་ཤེས་པས་མི་རྟོགས་སོ།
en: Omniscience cannot be comprehended by form, by feeling, by perception, by formations, or by consciousness.

source: །ཐམས་ཅད་མཁྱེན་པ་ནི་ཆོས་ཀྱིས་ཀྱང་མི་རྟོགས། ཆོས་མ་ཡིན་པས་ཀྱང་མི་རྟོགས་སོ།
en: Omniscience cannot be comprehended by phenomena or nonphenomena.

source: །ཐམས་ཅད་མཁྱེན་པ་ནི་སྦྱིན་པས་ཀྱང་མི་རྟོགས་སོ།
en: Omniscience cannot be comprehended by generosity.

source: སྦྱིན་པ་ཉིད་ཐམས་ཅད་མཁྱེན་པའོ།
en: Generosity in and of itself is omniscience.

source: །ཐམས་ཅད་མཁྱེན་པ་ནི་ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་ཀྱིས་ཀྱང་མི་རྟོགས་སོ།
en: Omniscience cannot be comprehended by discipline, patience, diligence, concentration, or insight.

source: ཤེས་རབ་ཉིད་ཐམས་ཅད་མཁྱེན་པའོ།
en: Insight in and of itself is omniscience. “

source: །ཡང་ཀྱེ་གྲོགས་པོ་དག་ཐམས་ཅད་མཁྱེན་པ་ནི་འདས་པ་མ་ཡིན། མ་འོངས་པ་མ་ཡིན། ད་ལྟར་བྱུང་བ་མ་ཡིན་ནོ།
en: Listen, friends! Furthermore, omniscience is neither past, present, nor future.

source: ཀྱེ་གྲོགས་པོ་དག་ཐམས་ཅད་མཁྱེན་པ་ནི་དུས་གསུམ་ལས་འདས་པའི་ཕྱིར་རོ།
en: Listen friends! It is because omniscience is beyond the three times. “

source: །ཡང་ཀྱེ་གྲོགས་པོ་དག་ཐམས་ཅད་མཁྱེན་པ་ནི་མིག་གི་རྣམ་པར་ཤེས་པས་རྣམ་པར་ཤེས་པར་བྱ་བ་མ་ཡིན་ནོ།
en: Listen, friends! Omniscience also is not cognizable by the eye consciousness.

source: །ཀྱེ་གྲོགས་པོ་དག་ཐམས་ཅད་མཁྱེན་པ་ནི་རྣ་བ་དང་།
en: Listen, friends!

source: སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པས་རྣམ་པར་ཤེས་པར་བྱ་བ་མ་ཡིན་ནོ།
en: Omniscience is not cognizable by the ear, nose, tongue, body, or mind consciousness.

source: ཀྱེ་གྲོགས་པོ་དག་ཐམས་ཅད་མཁྱེན་པ་ནི་ཡུལ་ཐམས་ཅད་ལས་འདས་པའོ།
en: Listen, friends! Omniscience is beyond all objects. “

source: །ཀྱེ་གྲོགས་པོ་དག་ཐམས་ཅད་མཁྱེན་པ་རྟོགས་པར་འདོད་པས་ཐམས་ཅད་མཁྱེན་པ་ཇི་ལྟར་གནས་པ་དེ་བཞིན་དུ་གནས་པར་བྱའོ།
en: Listen, friends! Those who wish to comprehend omniscience will be in agreement with how omniscience is.” “

source: །སྨྲས་པ། ཐམས་ཅད་མཁྱེན་པ་ཇི་ལྟར་གནས་པ་ལགས། སྨྲས་པ།
en: How is omniscience?” “

source: གང་ཆོས་ཐམས་ཅད་ལ་མི་གནས་པ་དེ་ནི་ཐམས་ཅད་མཁྱེན་པའོ།
en: Omniscience is that which does not dwell on any phenomena.

source: །ཆོས་ཐམས་ཅད་ལ་མཉམ་པ་ཉིད་དེ་ནི་ཐམས་ཅད་མཁྱེན་པ་སྟེ། སོ་སོའི་སྐྱེ་བོའི་ས་མཉམ་པ་ཉིད་དང་། སངས་རྒྱས་ཀྱི་ཆོས་སུ་མཉམ་ཞིང་དེ་ལྟར་ཆོས་ཐམས་ཅད་མཉམ་པ་དེ་ནི་ཐམས་ཅད་མཁྱེན་པའོ།
en: Sameness regarding all phenomena is omniscience, for the sameness of the level of ordinary beings, the sameness of the qualities of buddhahood, and likewise the sameness of all phenomena are omniscience. “

source: །བྱང་ཆུབ་སེམས་དཔས་འབྱུང་བ་ཆེན་པོ་བཞི་ལས་བྱུང་བའི་ལུས་དེ་ཉིད་མ་གཏོགས་པར་གཞན་དུ་ཐམས་ཅད་མཁྱེན་པ་བཙལ་བར་མི་བྱའོ།
en: Bodhisattvas should not seek omniscience separate from their very bodies, which arise from the four great elements.

source: ལུས་དེ་ནི་དངོས་པོ་མེད་པའོ།
en: The body is insubstantial.

source: །ལུས་ཞེས་བྱ་བ་དེ་ནི་དགེ་བ་དང་མི་དགེ་བའི་ཆོས་ལ་ལྷུན་གྱིས་གྲུབ་པའོ།
en: The body is naturally present in virtuous and nonvirtuous phenomena.

source: །ལུས་ཞེས་བྱ་བ་དེ་ནི་བདག་མ་ཡིན་པ་དང་བདག་མེད་པའོ།
en: The body is not self, and it is devoid of self.

source: །ལུས་ཞེས་བྱ་བ་དེ་ནི་མ་བྱུང་བ་ཡང་དག་པར་མ་བྱུང་བ་སྟེ། དེ་ལ་གདགས་པ་མེད་དོ།
en: The body is unarisen; it is truly unarisen and without imputation.

source: །གང་དེ་ལ་གདགས་པ་དེ་ཡང་མ་བྱུང་བའོ།
en: Anything imputed upon it is also unarisen.

source: །གང་དེ་མཐོང་བ་དེའང་མ་བྱུང་བའོ།
en: Whatever is seen is also unarisen.

source: །གང་མ་བྱུང་བ་དེ་ནི་ཡང་དག་པར་མ་བྱུང་བའོ།
en: That which is unarisen is truly unarisen.

source: །གང་ཡང་དག་པར་མ་བྱུང་བ་དེ་ནི་མི་ཤེས་པ་དང་མི་རྟོགས་པའོ།
en: That which is truly unarisen is unknowable and incomprehensible.

source: །གང་མི་ཤེས་པ་དང་མི་རྟོགས་པ་དེ་ནི་ཐམས་ཅད་མཁྱེན་པའོ།
en: That which is unknowable and incomprehensible is omniscience.”

source: །བསྟན་པ་འདི་བསྟན་པའི་ཚེ་ལྷའི་བུ་ཉིས་སྟོང་གིས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །ལྷའི་བུ་ཁྲི་ཉིས་སྟོང་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེས་སོ།
en: When this teaching was given, two thousand gods gained the acceptance that phenomena are nonarising, and twelve thousand gods developed the mind directed toward unsurpassed and perfect awakening.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤོབས་པའི་ཕུང་པོས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཇམ་དཔལ་ཚུར་སྤྱོན།
en: Then the bodhisattva great being Mass of Eloquence said to Mañjuśrī Kumārabhūta, “Mañjuśrī, please come.

source: དེ་བཞིན་གཤེགས་པའི་སྤྱན་སྔར་དོང་ལ། བྱང་ཆུབ་སེམས་དཔས་ཇི་ལྟ་བུར་བྱ་བ་དེ་བཞིན་གཤེགས་པ་ལ། མངོན་སུམ་དུ་ཞུའོ།
en: Come into the presence of the Thus-Gone One to ask the Thus-Gone One directly how bodhisattvas should act.”

source: །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་སའི་ཕྱོགས་དེ་ཉིད་དུ། བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་ཁ་དོག་དང་། དབྱིབས་དང་། ཆུ་ཞེང་འདྲ་བའི་དེ་བཞིན་གཤེགས་པ་ཞིག་མངོན་པར་སྤྲུལ་ཏོ།
en: Then, in that very place, Mañjuśrī Kumārabhūta emanated a thus-gone one in the exact likeness, shape, and proportions of the blessed Śākyamuni.

source: །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤོབས་པའི་ཕུང་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔས་ཇི་ལྟ་བུར་བྱ་བ་དེ་བཞིན་གཤེགས་པ་མངོན་དུ་བཞུགས་པ་འདི་ལ་ཞུས་ཤིག །
en: Mañjuśrī Kumārabhūta then said to the bodhisattva great being Mass of Eloquence, “Noble son, ask this thus-gone one directly how bodhisattvas should act.”

source: དེ་ནས་སྤྲུལ་པའི་དེ་བཞིན་གཤེགས་པ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤོབས་པའི་ཕུང་པོས་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔས་ཇི་ལྟ་བུར་བགྱི་ཞེས་དེ་སྐད་གསོལ་པ་དང་།
en: The bodhisattva great being Mass of Eloquence then asked the emanated thus-gone one, “Blessed One, how should bodhisattvas act?”

source: དེས་བཀའ་སྩལ་པ། ང་ཅི་འདྲ་བ་ལྟར་བྱང་ཆུབ་སེམས་དཔས་ཀྱང་དེ་བཞིན་དུ་བྱའོ།
en: He answered, “Bodhisattvas should act exactly as I do.” “

source: །གསོལ་པ། འོ་ན་བཅོམ་ལྡན་འདས་ཇི་འདྲ།
en: Well then, how does the Blessed One act?”

source: བཅོམ་ལྡན་འདས་དེས་བཀའ་སྩལ་པ། སྦྱིན་པ་མ་སྤྱད།
en: He answered, “Do not engage in generosity.

source: ཚུལ་ཁྲིམས་མ་སྤྱད།
en: Do not engage in discipline.

source: བཟོད་པ་མ་སྤྱད།
en: Do not engage in patience.

source: བརྩོན་འགྲུས་མ་སྤྱད།
en: Do not engage in diligence.

source: བསམ་གཏན་མ་སྤྱད།
en: Do not engage in concentration.

source: ཤེས་རབ་མ་སྤྱད།
en: Do not engage in insight.

source: འདོད་པའི་ཁམས་སུ་མ་སྤྱད།
en: Do not engage in the desire realm.

source: གཟུགས་ཀྱི་ཁམས་སུ་མ་སྤྱད།
en: Do not engage in the form realm.

source: གཟུགས་མེད་པའི་ཁམས་སུ་མ་སྤྱད།
en: Do not engage in the formless realm.

source: ལུས་ཀྱིས་མ་སྤྱད།
en: Do not engage with the body.

source: ངག་གིས་མ་སྤྱད།
en: Do not engage with speech.

source: ཡིད་ཀྱིས་མ་སྤྱད་པ་སྟེ།
en: Do not engage with the mind.

source: ཐམས་ཅད་དུ་མ་སྤྱད་ཅིང་མ་ཞུགས་པའོ།
en: Do not engage or act in any way at all.

source: །རིགས་ཀྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། ཇི་སྤྲུལ་པས་སྤྱད་དམ། གསོལ་པ།
en: Tell me, noble son, do emanations engage?” “

source: བཅོམ་ལྡན་འདས་སྤྲུལ་པས་མ་སྤྱད་དོ། །བཀའ་སྩལ་པ།
en: No, Blessed One, emanations do not engage.” “

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔས་དེ་ལྟར་བྱའོ།
en: Noble son, bodhisattvas should act likewise.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤོབས་པའི་ཕུང་པོས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པ་འདི་སྤྲུལ་པ་མ་ཡིན་གྲང་།
en: Then the bodhisattva great being Mass of Eloquence asked Mañjuśrī Kumārabhūta, “Mañjuśrī, is this thus-gone one considered to not be an emanation?”

source: དེས་སྨྲས་པ། རིགས་ཀྱི་བུ་ཆོས་ཐམས་ཅད་ནི་སྤྲུལ་པའི་རང་བཞིན་དུ་ངེས་ཏེ།
en: Mañjuśrī answered, “Noble son, know that all phenomena have the nature of emanations.

source: སྒྱུ་མའི་མཚན་ཉིད་ལས་མི་ལྡོག་གོ། །སྨྲས་པ།
en: They do not diverge from the characteristics of illusion.” “

source: འཇམ་དཔལ་དེ་བཞིན་ནོ།
en: Mañjuśrī, thus it is.

source: །ཆོས་ཐམས་ཅད་ནི་སྤྲུལ་པའི་རང་བཞིན་ཅན་ཏེ།
en: All phenomena have the nature of emanations.

source: ཆོས་ཐམས་ཅད་སྤྲུལ་པའི་རང་བཞིན་ཅན་ཡིན་ན། ཁྱོད་ཅིའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་འདི་སྤྲུལ་པ་མ་ཡིན་གྲང་སྙམ་དུ་བྱེད་པར་གྱུར། སྨྲས་པ།
en: If all phenomena have the nature of emanations, why would you think that this thus-gone one is considered to not be an emanation?” “

source: སུས་སྤྲུལ། སྨྲས་པ།
en: Who emanated?” “

source: བདག་གིས་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ཡོངས་སུ་དག་པས་སྤྲུལ་གྱིས།
en: I emanated through the pure ripening of action.

source: འདི་ལ་རང་བཞིན་གྱིས་བདག་གམ། སེམས་ཅན་ནམ། སྲོག་གམ། གང་ཟག་དག་སངས་རྒྱས་སུ་གནས་པའམ། སོ་སོའི་སྐྱེ་བོར་གནས་པ་ནི་མ་ཡིན་ནོ།
en: However, by nature there is no self, being, life principle, or person that exists here, whether as a buddha or an ordinary being.”

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པའི་སྐུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤོབས་པའི་ཕུང་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཀྱིས་གང་ལ་བསླབས་ནས་བྱང་ཆུབ་ཐོབ་པར་གྱུར།
en: Then the bodhisattva great being Mass of Eloquence asked the form of the Thus-Gone One, “How did the Blessed One train to gain awakening?” “

source: བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་མི་སློབ་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སློབ་པའོ།
en: Noble son, not training is a bodhisattva’s training.

source: །མི་སྡོམ་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སློབ་པའོ།
en: Not restraining is a bodhisattva’s training.

source: །མི་འཇིགས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སློབ་པའོ།
en: Not fearing is a bodhisattva’s training.

source: །མི་རྟོག་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སློབ་པའོ།
en: Not conceptualizing is a bodhisattva’s training.

source: །མི་དཔྱོད་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སློབ་པའོ། །རིགས་ཀྱི་བུ་གནས་མེད་པ་དང་། མི་སྙེམས་པ་དང་། མ་སྤྲོས་པ་དང་། མི་ལེན་པ་དང་། མི་གཏོང་བ་དང་། མི་རྒྱུ་བ་དང་། ཡི་གེ་མེད་པ་དང་། མི་སྐྱེ་བ་དང་། མི་འགག་པ་དང་། མ་འོངས་པ་དང་། མ་སོང་བ་དང་།
en: Not analyzing is a bodhisattva’s training. “

source: མི་གནས་པ་དང་། མཚན་མ་མེད་པ་དང་། དངོས་པོ་མེད་པ་དང་། མི་དམིགས་དང་། འདུ་ཤེས་ཐམས་ཅད་དང་བྲལ་བ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་སློབ་པ་སྟེ།
en: Noble son, not abiding, not thinking, not elaborating, not taking, not giving, not moving, not using words, not arising, not ceasing, not coming, not going, not having a basis, the absence of marks, the absence of substance, not apprehending, and not perceiving in any way is the training of bodhisattva great beings. “

source: གང་དེ་ལྟར་སློབ་པ་དེ་དག་ནི་ཡང་དག་པར་སློབ་པའོ།
en: Those who train in this manner train correctly.

source: །གང་དེ་ལྟར་སློབ་པ་དེ་དག་ནི་གང་ལའང་ཞེ་སྡང་བ་མེད་དོ།
en: Those who train in this manner have no aggression toward anyone.

source: །གང་དེ་ལྟར་སློབ་པ་དེ་དག་ནི་གང་དུའང་ཆགས་པ་མེད་དོ།
en: Those who train in this manner are free of attachment toward anything.

source: །གང་དེ་ལྟར་སློབ་པ་དེ་དག་ནི་གང་དུ་ཡང་ཞེན་པ་མེད་དོ།
en: Those who train in this manner are free of clinging to anything at all.

source: །གང་ལས་ཀྱང་གྲོལ་བ་མེད་དོ།
en: They are not liberated from anything.

source: །གང་དེ་ལྟར་སློབ་པ་དེ་དག་ནི་གང་དུ་ཡང་འདོད་ཆགས་པ་མེད་དོ།
en: Those who train in this manner are free of desire for anything.

source: །གང་ནས་ཀྱང་འདོད་ཆགས་དང་བྲལ་བ་མེད་དོ།
en: They do not separate from desire.

source: །ཞེ་སྡང་མེད་དོ།
en: They have no aggression.

source: །གཏི་མུག་མེད་དོ།
en: They have no delusion.

source: །གང་དེ་ལྟར་སློབ་པ་དེ་དག་ནི་སློབ་འདོད་པ་ཞེས་བྱའོ།
en: Training in this manner is called yearning to train.

source: །གང་སློབ་འདོད་པ་དེ་དག་ནི་འགྲོ་བ་གང་དུ་ཡང་མི་འགྲོའོ། །མི་འོང་ངོ་།
en: Those who yearn to train do not proceed to, or arrive at, any existence.

source: །དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་ང་ཇི་ལྟ་བ་བཞིན་དུ་འཁོར་བ་ཡང་མེད། མྱ་ངན་ལས་འདའ་བ་ཡང་མེད། གཏོང་བ་ཡང་མེད། ལེན་པ་ཡང་མེད། ཚུལ་ཁྲིམས་ཀྱང་མེད། ངང་ཚུལ་ངན་པ་ཡང་མེད། བཟོད་པ་ཡང་མེད། གནོད་སེམས་ཀྱང་མེད། བརྩོན་འགྲུས་ཀྱང་མེད། ལེ་ལོ་ཡང་མེད། བསམ་གཏན་ཡང་མེད། གཡེང་བ་ཡང་མེད། ཤེས་རབ་ཀྱང་མེད། ཤེས་རབ་འཆལ་པ་ཡང་མེད། སློབ་པ་ཡང་མེད། མི་སློབ་པ་ཡང་མེད། སྤྱོད་པ་ཡང་མེད། མི་སྤྱོད་པ་ཡང་མེད་ཅིང་། ང་ཇི་ལྟ་བ་བཞིན་དུ་ཐོབ་པ་ཡང་མེད། མ་ཐོབ་པ་ཡང་མེད། མངོན་པར་བྱ་བ་ཡང་མེད།
en: Therefore, bodhisattva great beings who yearn to fully awaken to unsurpassed and perfect buddhahood should be just like me—they should have neither saṃsāra nor nirvāṇa, they should neither give nor take, they should have neither discipline nor inappropriate comportment, they should have neither patience nor malice, they should have neither diligence nor laziness, they should have neither concentration nor distraction, they should have neither insight nor misunderstanding, they should have neither training nor nontraining, and they should have neither engagement nor nonengagement.

source: བྱང་ཆུབ་ཀྱང་མེད། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱང་མེད། བདག་ཏུ་འདུ་ཤེས་པ་ཡང་མེད། སེམས་ཅན་དུ་འདུ་ཤེས་པ་ཡང་མེད། སྲོག་ཏུ་འདུ་ཤེས་པ་ཡང་མེད། གང་ཟག་ཏུ་འདུ་ཤེས་པ་ཡང་མེད། ཆོས་སུ་འདུ་ཤེས་པ་ཡང་མེད།
en: Just like me, they should be without attainment, nonattainment, manifestation, awakening, buddha qualities, perception of a self, perception of a being, perception of a life principle, perception of personhood, and perception of phenomena.

source: འདུ་ཤེས་པ་ཉིད་ཀྱང་མེད། འདུ་ཤེས་མེད་པའང་མ་ཡིན་པར་ངའི་རྗེས་སུ་བསླབ་པར་བྱའོ།
en: They should be without perception and nonperception.

source: རིགས་ཀྱི་བུ་ཆོས་ཐམས་ཅད་ནི་སྒྱུ་མའི་མཚན་ཉིད་ཀྱི་རང་བཞིན་ཡིན་པ་དང་། ཐ་དད་པར་གྱུར་པ་མེད་པས་མི་འགྱུར་བའོ།
en: Noble son, all phenomena are unchanging because they are undifferentiated from the nature of the characteristics of illusion.

source: །རིགས་ཀྱི་བུ་ཆོས་ཐམས་ཅད་ནི་སོ་སོ་ཐ་དད་པ་མེད་པས་གཉིས་སུ་མེད་པའོ།
en: Noble son, all phenomena are nondual because they are not individually differentiated.

source: རིགས་ཀྱི་བུ་ཆོས་ཐམས་ཅད་ནི་མིག་གི་ལམ་ལས་འདས་པས་བལྟར་མི་སྣང་བའོ།
en: Noble son, all phenomena do not appear to be seen because they are beyond the domain of vision.

source: །རིགས་ཀྱི་བུ་ཆོས་ཐམས་ཅད་ནི་ཁྱད་པར་མེད་པའི་ཕྱིར་མཉམ་པའོ།
en: Noble son, all phenomena are the same because they are without difference.

source: །རིགས་ཀྱི་བུ་ཆོས་ཐམས་ཅད་ནི་གཡོ་བ་མེད་ཅིང་བྱེད་པ་མེད་པའི་ཕྱིར་གླེན་པ་སྟེ།
en: Noble son, all phenomena are inactive because they are without movement or action.

source: དེ་དག་ལ་གདགས་པ་མེད་དོ། །གདགས་པ་མེད་པའི་ཆོས་རྣམས་ནི་ཤིན་ཏུ་མ་སྐྱེས་པའོ།
en: They are without imputation, and unimputed phenomena are utterly unarisen.

source: །གང་དེ་ལྟར་མོས་པ་དེ་དག་ནི་གྲོལ་བས་མི་སྙེམས། སྤྱོད་པས་མི་སྙེམས། བྱང་ཆུབ་ཀྱིས་མི་སྙེམས་སོ།
en: Whoever trusts this will not conceptualize liberation, engagement, or awakening.

source: །རིགས་ཀྱི་བུ་དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་འདི་འདྲ་བའི་སློབ་པ་དང་། སྤྱོད་པ་བཤད་པའི་ཚེ་མི་འཇིགས། མི་དངང་། སྐྲག་པར་མི་འགྱུར་ཏེ།
en: Therefore, noble son, when such training and engagement is described, bodhisattva great beings do not become frightened, anxious, or scared.

source: དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱའོ།
en: That is a bodhisattva. “

source: །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་ནམ་མཁའི་དབྱིངས་ནི་མེས་མི་འཇིགས། རླུང་གིས་མི་འཇིགས། ཆར་པས་མི་འཇིགས། ཐན་པས་མི་འཇིགས། རྡུལ་གྱིས་མི་འཇིགས། དུ་བས་མི་འཇིགས། སྤྲིན་གྱི་ཕུང་པོས་མི་འཇིགས། གློག་གིས་མི་འཇིགས་སོ།
en: To draw an analogy, noble son, the expanse of the sky is not frightened by fire, wind, rain, drought, dust, smoke, clouds, or lightning.

source: ནམ་མཁའི་དབྱིངས་ནི་གཟུང་དུ་མེད་པའི་ཕྱིར་རོ།
en: The expanse of the sky cannot be apprehended.

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔས་ཀྱང་ཆོས་ཐམས་ཅད་ཀྱིས་མི་འཇིགས་པར་བྱའོ།
en: In the same way, noble son, bodhisattvas should not be frightened by any phenomena.

source: །བདེ་བ་དང་སྡུག་བསྔལ་བ་ཐམས་ཅད་ལ་མི་བསམ་པར་བྱ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་ནམ་མཁའ་དང་མཚུངས་པས་བདུད་ཀྱི་སྡེ་ལས་རྒྱལ་བར་ནུས་སོ།
en: They should not think about any happiness or suffering, for the minds of bodhisattvas are like the sky. That is why they can defeat the hordes of Māra.

source: །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་ནུས་སོ།
en: They can fully awaken to unsurpassed and perfect buddhahood.

source: །སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱེད་ནུས་སོ།
en: They can ensure the benefit of beings.”

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པ་སྤྲུལ་པ་དེས་དེ་སྐད་གསུངས་ནས། དེ་ཉིད་དུ་མི་སྣང་བར་གྱུར་ཏོ།
en: Having said this, the emanated Thus-Gone One immediately disappeared.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སྤོབས་པའི་ཕུང་པོས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པ་དེ་གར་གཤེགས།
en: The bodhisattva great being Mass of Eloquence then asked Mañjuśrī Kumārabhūta, “Mañjuśrī, where has the Thus-Gone One gone to?” “

source: སྨྲས་པ། གང་ནས་གཤེགས་པར་རོ།
en: To where he came from.” “

source: །སྨྲས་པ། འོ་ན་དེ་གང་ནས་གཤེགས། སྨྲས་པ།
en: Well then, from where did he come?” “

source: གང་དུ་གཤེགས་པ་ནས་སོ། །སྨྲས་པ།
en: From where he is going.” “
